import React from 'react'
import { Button } from '../../ui/Button/Button'
import style from './UserArea.module.css'

export const UserArea = () => {
    return (
        <>
            <section className={style.panel}>
                <div className={style.profile}>
                    <div className={style.info}>
                        <h2 className={style.title}>Username</h2>
                        <p>Зарегестрирован: <span className={style.item}>21.08.2013</span></p>
                        <div className={style.profiles}>
                            <p>Профили: </p>
                            <div className={style.icons}>
                                <svg xmlns="http://www.w3.org/2000/svg" width="14" height="14" viewBox="0 0 14 14" fill="none">
                                    <path fill-rule="evenodd" clip-rule="evenodd" d="M7 0C3.1325 0 0 3.21173 0 7.17706C0 10.3529 2.00375 13.0353 4.78625 13.9863C5.13625 14.0491 5.2675 13.8338 5.2675 13.6454C5.2675 13.4749 5.25875 12.9097 5.25875 12.3087C3.5 12.6406 3.045 11.8691 2.905 11.4653C2.82625 11.259 2.485 10.622 2.1875 10.4516C1.9425 10.317 1.5925 9.98508 2.17875 9.97611C2.73 9.96714 3.12375 10.4964 3.255 10.7118C3.885 11.7973 4.89125 11.4923 5.29375 11.3039C5.355 10.8374 5.53875 10.5234 5.74 10.3439C4.1825 10.1645 2.555 9.54548 2.555 6.80026C2.555 6.01976 2.82625 5.37382 3.2725 4.87143C3.2025 4.692 2.9575 3.95635 3.3425 2.96951C3.3425 2.96951 3.92875 2.78111 5.2675 3.70516C5.8275 3.54367 6.4225 3.46293 7.0175 3.46293C7.6125 3.46293 8.2075 3.54367 8.7675 3.70516C10.1062 2.77214 10.6925 2.96951 10.6925 2.96951C11.0775 3.95635 10.8325 4.692 10.7625 4.87143C11.2087 5.37382 11.48 6.01078 11.48 6.80026C11.48 9.55446 9.84375 10.1645 8.28625 10.3439C8.54 10.5682 8.75875 10.9988 8.75875 11.6717C8.75875 12.6316 8.75 13.4032 8.75 13.6454C8.75 13.8338 8.88125 14.0581 9.23125 13.9863C11.9963 13.0353 14 10.3439 14 7.17706C14 3.21173 10.8675 0 7 0Z" fill="white" />
                                </svg>
                            </div>
                        </div>
                    </div>
                    <Button handler={() => console.log('Достижений нет :(')} className={style.button} children='Посмотреть достижения' />
                </div>
                <div className={style.progress}>
                    <h2 className={style.title}>Прогресс</h2>
                    <p>Всего закончено: <span className={style.item}>28</span></p>
                    <p>Достижений получено: <span className={style.item}>12</span></p>
                    <div className={style.chapters}>
                        <div className={style.chapter}>
                            <div className={style.subtract}>
                            <p className={style.percent}>0%</p>
                                <svg xmlns="http://www.w3.org/2000/svg" width="100" height="100" viewBox="0 0 100 100" fill="none">
                                    <path fill-rule="evenodd" clip-rule="evenodd" d="M0.558752 42.5C3.80938 20.8901 20.8901 3.80938 42.5 0.558752C44.9464 0.190749 47.4509 0 50 0C52.549 0 55.0535 0.190749 57.5 0.558752C81.5563 4.17738 100 24.9348 100 50C100 77.6142 77.6142 100 50 100C24.9348 100 4.17738 81.5563 0.558752 57.5C0.190749 55.0535 0 52.549 0 50C0 47.451 0.190749 44.9465 0.558752 42.5ZM15 50C15 30.67 30.67 15 50 15C69.33 15 85 30.67 85 50C85 69.33 69.33 85 50 85C30.67 85 15 69.33 15 50Z" fill="black" />
                                    <path fill-rule="evenodd" clip-rule="evenodd" d="M0.558752 42.5C3.80938 20.8901 20.8901 3.80938 42.5 0.558752C44.9464 0.190749 47.4509 0 50 0C52.549 0 55.0535 0.190749 57.5 0.558752C81.5563 4.17738 100 24.9348 100 50C100 77.6142 77.6142 100 50 100C24.9348 100 4.17738 81.5563 0.558752 57.5C0.190749 55.0535 0 52.549 0 50C0 47.451 0.190749 44.9465 0.558752 42.5ZM15 50C15 30.67 30.67 15 50 15C69.33 15 85 30.67 85 50C85 69.33 69.33 85 50 85C30.67 85 15 69.33 15 50Z" fill="black" />
                                </svg>
                            </div>
                            <p className={style.text}>Раздел 1</p>
                        </div>
                        <div className={style.chapter}>
                            <div className={style.subtract}>
                            <p className={style.percent}>0%</p>
                                <svg xmlns="http://www.w3.org/2000/svg" width="100" height="100" viewBox="0 0 100 100" fill="none">
                                    <path fill-rule="evenodd" clip-rule="evenodd" d="M0.558752 42.5C3.80938 20.8901 20.8901 3.80938 42.5 0.558752C44.9464 0.190749 47.4509 0 50 0C52.549 0 55.0535 0.190749 57.5 0.558752C81.5563 4.17738 100 24.9348 100 50C100 77.6142 77.6142 100 50 100C24.9348 100 4.17738 81.5563 0.558752 57.5C0.190749 55.0535 0 52.549 0 50C0 47.451 0.190749 44.9465 0.558752 42.5ZM15 50C15 30.67 30.67 15 50 15C69.33 15 85 30.67 85 50C85 69.33 69.33 85 50 85C30.67 85 15 69.33 15 50Z" fill="black" />
                                    <path fill-rule="evenodd" clip-rule="evenodd" d="M0.558752 42.5C3.80938 20.8901 20.8901 3.80938 42.5 0.558752C44.9464 0.190749 47.4509 0 50 0C52.549 0 55.0535 0.190749 57.5 0.558752C81.5563 4.17738 100 24.9348 100 50C100 77.6142 77.6142 100 50 100C24.9348 100 4.17738 81.5563 0.558752 57.5C0.190749 55.0535 0 52.549 0 50C0 47.451 0.190749 44.9465 0.558752 42.5ZM15 50C15 30.67 30.67 15 50 15C69.33 15 85 30.67 85 50C85 69.33 69.33 85 50 85C30.67 85 15 69.33 15 50Z" fill="black" />
                                </svg>
                            </div>
                            <p className={style.text}>Раздел 2</p>
                        </div>
                        <div className={style.chapter}>
                            <div className={style.subtract}>
                            <p className={style.percent}>0%</p>
                                <svg xmlns="http://www.w3.org/2000/svg" width="100" height="100" viewBox="0 0 100 100" fill="none">
                                    <path fill-rule="evenodd" clip-rule="evenodd" d="M0.558752 42.5C3.80938 20.8901 20.8901 3.80938 42.5 0.558752C44.9464 0.190749 47.4509 0 50 0C52.549 0 55.0535 0.190749 57.5 0.558752C81.5563 4.17738 100 24.9348 100 50C100 77.6142 77.6142 100 50 100C24.9348 100 4.17738 81.5563 0.558752 57.5C0.190749 55.0535 0 52.549 0 50C0 47.451 0.190749 44.9465 0.558752 42.5ZM15 50C15 30.67 30.67 15 50 15C69.33 15 85 30.67 85 50C85 69.33 69.33 85 50 85C30.67 85 15 69.33 15 50Z" fill="black" />
                                    <path fill-rule="evenodd" clip-rule="evenodd" d="M0.558752 42.5C3.80938 20.8901 20.8901 3.80938 42.5 0.558752C44.9464 0.190749 47.4509 0 50 0C52.549 0 55.0535 0.190749 57.5 0.558752C81.5563 4.17738 100 24.9348 100 50C100 77.6142 77.6142 100 50 100C24.9348 100 4.17738 81.5563 0.558752 57.5C0.190749 55.0535 0 52.549 0 50C0 47.451 0.190749 44.9465 0.558752 42.5ZM15 50C15 30.67 30.67 15 50 15C69.33 15 85 30.67 85 50C85 69.33 69.33 85 50 85C30.67 85 15 69.33 15 50Z" fill="black" />
                                </svg>
                            </div>
                            <p className={style.text}>Раздел 3</p>
                        </div>
                    </div>
                </div>
                <div className={style.image}></div>
            </section>
        </>
    )
}
